m3iz/pic12f476-uart/Main.c
#include <xc.h>
#include <string.h>
#define _XTAL_FREQ 4000000  // ?????????? ??????? ????????? ?????????? (????????, 4 ???)

#define Baudrate       1200                      // ???????? ???????? ?????? (???/?)
#define OneBitDelay    (1000000 / Baudrate)      // ???????? ??? ?????? ???? ? ?????????????
#define DataBitCount   8                         // ?????????? ??? ??????

#define UART_TX        GP0                       // TX ??? ??? ???????? ??????
#define UART_TX_DIR    TRISIO0                   // ??????????? ????? ??? TX
#define UART_RX        GP1                         // RX ??? ??? ?????? ??????
#define UART_RX_DIR    TRISIO1                     // ??????????? ????? ??? RX

// ???????????? ??? PIC12F675
__CONFIG(FOSC_INTRCIO & WDTE_OFF & PWRTE_ON & MCLRE_OFF & BOREN_ON & CP_OFF & CPD_OFF);

void InitSoftUART(void) {
    UART_TX = 1;          // ?????????? TX ??? ? ??????? ??????? ? ?????? ????????
    UART_TX_DIR = 0;      // ?????????? TX ??? ?????
    UART_RX_DIR = 1;      // ?????????? RX ??? ????
}

char UART_Receive(void) {
    char ReceivedValue = 0;

    // ???? ?????? ???????? (????????? ???)
    while (UART_RX == 1);  // ????????, ???? ????? RX ?? ?????? ?????? (????????? ???)

    __delay_us(OneBitDelay); // ?????????? ????? ??? ???????????? ???????

    // ?????? ?????? ??????? (LSB ??????)
    for (unsigned char i = 0; i < DataBitCount; i++) {
        ReceivedValue |= (UART_RX << i);  // ????????? ??????? ???
        __delay_us(OneBitDelay);
    }

    // ???? ????????? ???????? (???????? ???)
    __delay_us(OneBitDelay);

    return ReceivedValue;
}

void UART_Transmit(const char DataValue) {
    // ???????? ?????????? ????
    UART_TX = 0;
    __delay_us(OneBitDelay);

    // ???????? ?????? ??????? (LSB ??????)
    for (unsigned char i = 0; i < DataBitCount; i++) {
        UART_TX = (DataValue >> i) & 0x1;  // ?????????? TX ? ???????????? ? ?????
        __delay_us(OneBitDelay);
    }

    // ???????? ????????? ????
    UART_TX = 1;
    __delay_us(OneBitDelay);
}

void UART_SendString(const char* str) {
    while (*str) {            // ???? ?? ????????? ????? ??????
        UART_Transmit(*str);   // ???????? ??????? ??????
        str++;                 // ??????? ? ?????????? ???????
    }
}

void SetGPIOToInput(void) {
    // ??????? ????? GP2 - GP5 ? ????? ?????
    TRISIO3 = 1;
    TRISIO4 = 1;
    TRISIO5 = 1;
}

void ReadAndSendGPIOStates(void) {
    // ?????? ????????? ????? GP3 - GP5
    char gpioStates[5] = {0};
    gpioStates[0] = '0' + GP2;
    gpioStates[1] = '0' + GP3;  
    gpioStates[2] = '0' + GP4;  
    gpioStates[3] = '0' + GP5;  
    gpioStates[4] = '\0';       

    // ???????? ????????? ????? ??? ??????
    UART_SendString(gpioStates);
}

void SetGPIOToOutput(unsigned char pin) {
    // ????????? ??????????? ???? ??? ?????
    switch (pin) {
        case 2:
            TRISIO2 = 0;
            break;
        case 3:
            TRISIO3 = 0;
            break;
        case 4:
            TRISIO4 = 0;
            break;
        case 5:
            TRISIO5 = 0;
            break;
        default:
            break;
    }
}

void SetGPIOState(unsigned char pin, unsigned char state) {
    // ????????? ????????? ???? (0 - ??????, 1 - ???????)
    switch (pin) {
        case 2:
            GP2 = state;
            break;
        case 3:
            GP3 = state;
            break;
        case 4:
            GP4 = state;
            break;
        case 5:
            GP5 = state;
            break;
        default:
            break;
    }
}

void main() {
    // ????????? ????? ? UART
    char ch;
    ANSEL = 0x00;       // ?????????? ????? ??? ????????
    CMCON = 0x07;       // ????????? ??????????
    InitSoftUART();     // ???????????????? UART
    
    while (1) {
        ch = UART_Receive();
        if(ch == '-'){
            char rxbuf[20] = {0}; // ????????????? ?????? ??? ????????????
            int i = 0;
            while(i < 20){ // ??????????? ????? ???????? ??????
                rxbuf[i] = UART_Receive();
                if(rxbuf[i] == 0x0D){
                    rxbuf[i] = '\0'; // ??????????? ??????? ??????
                    break;
                }
                i++;
            }
            if (strcmp(rxbuf, "1") == 0) {
                SetGPIOToInput();       // ????????? GP2-GP5 ? ????? ?????
                ReadAndSendGPIOStates(); // ????????? ????????? ? ????????? ??????
                }
            else if (strncmp(rxbuf, "SET_GPIO_", 9) == 0) {
                // ?????????? ?????? ???? ? ????????? ?? ???????
                unsigned char pin = rxbuf[9] - '0';  // ???????? ????? ????
                if (pin >= 2 && pin <= 5) { // ????????? ?????????? ?????? ?????
                    SetGPIOToOutput(pin); // ????????? ??? ? ????? ??????
                    if (strcmp(&rxbuf[11], "UP") == 0) {
                        SetGPIOState(pin, 1); // ????????????? ??????? ???????
                        UART_SendString("Pin set to HIGH");
                    } else if (strcmp(&rxbuf[11], "DOWN") == 0) {
                        SetGPIOState(pin, 0); // ????????????? ?????? ???????
                        UART_SendString("Pin set to LOW");
                    } else {
                        UART_SendString("Invalid direction");
                    }
                } else {
                    UART_SendString("Invalid pin number");
                }
            } else {
                UART_SendString("Invalid command");
                UART_SendString(rxbuf);
            }   
        }
        __delay_ms(1000);          // ???????? ????? ????????? ?????????
    }
}
